import config

# Tips
tip_exit       = '\nДля выхода напиши "exit":\n'
tip_text       = 'Введите любой текст'

# Achivements
ach_received   = 'Вы получили достижение:'
ach_mamont     = 'Мамонт заскамлен'

# Start
start          = f'Привет, меня зовут {config.Name}, бот на все случаи жизни(ну или на те что предусмотрены кодом)\nЧтобы вывести список команд напиши help'

# Help
help           = 'Список команд пока не доступен'

# News
news           = 'Новое в Боте:\n  Start использует f-строку (а зачем? (а чтобы в переменной start была одна строка, а не две(а оно мешало?)))\n  Начало избеения кода в надежде на будующую поддержку мультиязычности'

# Dialog
dialog_welcome = 'Режим разговора. Тут ты можешь действительно поболтать о чем угодно. Чтобы выйти напиши "exit"'
dialog_r1      = 'Хаха\nТы думал, я сюда ИИ запихал?'
dialog_r2      = 'АХАХАХАХАХА'

# New
new_rep1       = 'Я сделяль новые функции, а это динозавр их сломал'
new_rep2       = 'Честно\n'
new_rep3       = 'Но я уже делаю новые со скоростью угашенной улитки!'

# Echo-mode
echomode_ex1   = '(Чтобы выйти напишите stop):'
echomode_ex2   = '(А волшебное слово):'
echomode_ex3   = '(Не расслышал):'
echomode_ex4   = '(А теперь всё вместе):'
echomode_exit  = 'Ну ладно, ладно. Не бугурти.'

# Rando
rando_rep1     = 'Минимальное число:'
rando_rep2     = 'Максимальное число:'

# Exit
exit           = 'Пока!'