import config

# Tips
tip_exit       = 'Для выхода напиши "exit"'
tip_text       = 'Введите любой текст'

# Achivements
ach_mamont     = 'Мамонт заскамлен'
ach_received   = 'Вы получили достижение:'

# Start
start          = f'Привет, меня зовут {config.Name}, бот на все случаи жизни(ну или на те что предусмотрены кодом)\nЧтобы вывести список команд напиши help'

# Help
help           = 'Список команд пока не доступен'

# News
news_rep1      =  'Start использует f-строку (а зачем? (а чтобы в переменной start была одна строка, а не две(а оно мешало?)))'
news_rep2      =  'Начало избеения кода в надежде на будующую поддержку мультиязычности'
news_main      = f'Новое в Боте:\n - {news_rep1}\n - {news_rep2}'

# Dialog
dialog_welcome = 'Режим разговора. Тут ты можешь действительно поболтать о чем угодно. Чтобы выйти напиши "exit"'
dialog_rep1    = 'Хаха\nТы думал, я сюда ИИ запихал?'
dialog_rep2    = 'АХАХАХАХАХА'

# New
new_rep1       = 'Я сделяль новые функции, а это динозавр их сломал'
new_rep2       = 'Честно\n'
new_rep3       = 'Но я уже делаю новые со скоростью угашенной улитки!'

# Echo-mode
echomode_rep1  = '(Чтобы выйти напишите stop):'
echomode_rep2  = '(А волшебное слово):'
echomode_rep3  = '(Не расслышал):'
echomode_rep4  = '(А теперь всё вместе):'
echomode_exit  = 'Ну ладно, ладно. Не бугурти.'

# Rando
rando_rep1     = 'Минимальное число:'
rando_rep2     = 'Максимальное число:'

# Exit
exit           = 'Пока!'
